package com.it.day;

public class D06 {
    public static void main(String[] args) {

          //TODO 面向对象
          /*类：结构体，里面包含了属性（特征）和方法（行为）   会有很多的对象
            class:关键字（小写）
            类名：类的名称 标识符 首字母大写
            对象：类的实例化（具象化） new 类名 （  ）
            new也是关键字，表示创建一个具体的对象，而且，使用一次，创建一次，每次都是全新的
            一般new出来的对象会赋值给变量，方便重复使用
            变量的类型就是对象的类型
            对象是将内存地址赋值给了变量，所以变量其实引用了内存中的对象，所以称之为引用变量，
            而变量的类型称之为引用数据类型
            特殊的对象：空对象，没有引用的对象
            所有引用类型变量的默认取值就是null
            属性：类的对象的相同特征 语法和变量的声明很像
            属性类型 属性名称 = 属性值
            如果在声明属性的同时进行了初始化赋值，那么所有对象的属性就完全相同
            如果希望每个对象的属性不一致，那么可以不用在声明属性的时候进行初始化
            属性会在构造对象的时候默认初始化，而默认初始化的值取决于属性的类型
            变量的作用域非常小，只在当前的大括号内有效
            属性不仅仅在当前类中有效，而且可以随着对象在其他地方使用
            变量使用前必须初始化，否则会报错，属性可以不用初始化，因为JVM会帮助我们自动完成初始化*/

    }
}